[
{
    "mod": 1,
    "description": "This week we're starting! We're going to start by reviewing the course outline. After that, we'll learn: <strong>what a database is</strong>, and how they're used in web development; <strong>what <abbr title='Structured Query Language'>SQL</abbr> is</strong>; how to set up <strong>SQL Developer</strong> so that we can use the <strong>Oracle <abbr title='Relational Database Management System'>RDBMS</abbr></strong>; basic SQL terms definitions; simple single-table queries.",
    "showSlides": true,
    "extraContent": [{"text": "Syllabus", "href": "./assets/documents/HTTP5105-syllabus.pdf"}],
    "reading": "Murach’s Oracle, Chapters 1 & 2"
},
{
    "mod": 2,
    "description": "This week we'll cover retrieving rows from a single table; implementing arithmetic statements; renaming columns in results; retrieving rows using comparison operators; using DISTINCT to eliminate duplicate rows; defining the logical operators AND, OR and NOT; retrieving rows using LIKE, BETWEEN, IN and IS NULL operators; sorting the result set using ORDER BY.",
    "reading": "Murach’s Oracle, Chapter 3",
    "extraContent": [{"text": "Assignment 1", "href": "./assignments/assignment-1.html"}],
    "showSlides": true
},
{
    "mod": 3,
    "description": "This week we'll cover coding INNER JOINs to retrieve rows from multiple tables; the use of a self-join; table aliases; JOIN with implicit INNER JOIN syntax; OUTER JOINs to retrieve rows form multiple tables; the various set operators.",
    "reading": "Murach’s Oracle, Chapter 4",
    "extraContent": [{"text": "Assignment 2", "href": "./assignments/assignment-2.html"}],
    "showSlides": true
},
{
    "mod": 4,
    "description": "This week we'll cover queries that use aggregate functions; queries with MAX, MIN, COUNT, AVG, and SUM group functions; the use of the GROUP BY and HAVING clauses; the differences between HAVING and WHERE clauses. We'll cover subqueries & have a brief introduction to CRUD.",
    "reading": "Murach’s Oracle, Chapter 5",
    "extraContent": [{"text": "Assignment 3", "href": "./assignments/assignment-3.html"}],
    "showSlides": true
},
{
    "mod": 5,
    "description": "This week we'll cover how to create a test table; insert new data to a table; update existing data; delete data from a table; work with date/time data; various data types used in Oracle; functions for working with numeric data; functions for working with null data values; nvl and nvl2; converting data from one type to another.",
    "reading": "Murach’s Oracle, Chapters 7 & 8",
    "showSlides": true
},
{
    "mod": 6,
    "description": "This week we'll cover the basic steps to design a database; relationships between tables; normalization; how to define data elements; identify tables and assign columns; identify primary and foreign keys; primary key constraint; a foreign key constraint; creating tables and sequences; the use of COMMIT and ROLLBACK for changes.",
    "reading": "Murach’s Oracle, Chapters 9 & 10",
    "extraContent": [{"text": "Assignment 4", "href": "./notes/week-5/index.html#lab"}],
    "showSlides": true
},
{
    "mod": 7,
    "description": "This week we'll cover anonymous PL/SQL; how a cursor is used; how to handle exceptions; the use of bind variables; declaring variables in PL/SQL; IF statements; loops.",
    "reading": "Murach’s Oracle, Chapter 13",
    "extraContent": [{"text": "Assignment 5", "href": "./assignments/assignment-5.html"}],
    "showSlides": true
},
{
    "title": "Midterm",
    "description": "You'll do fine!",
    "extraContent": [{"text": "Midterm", "href": "./"}],
    "showSlides": false,
    "noSlides": true
},
{
    "mod": 8,
    "description": "This week we'll cover stored procedures; a stored procedure that inserts a row; a stored procedure drops a table; optional parameters, input and output parameters; how to raise errors",
    "reading": "Murach’s Oracle, Chapter 15",
    "extraContent": [{"text": "Assignment 7", "href": "./assignments/assignment-7.html"}],
    "showSlides": false
},
{
    "mod": 9,
    "description": "This week we'll cover simple queries in MySQL; using column aliases in MySQL; retrieving rows using GROUP BY and HAVING clauses; limiting search results in MySQL with the LIMIT clause; using JOINs to retrieve rows from multiple tables in MySQL; retrieving rows using inner and outer joins.",
    "reading": "Murach’s MySQL, Chapters 6 & 7",
    "extraContent": [{"text": "Assignment 8", "href": "./assignments/assignment-8.html"}],
    "showSlides": false
},
{
    "mod": 10,
    "description": "This week we'll cover INSERT, DELETE and UPDATE on rows with MySQL; using REPLACE and TRUNCATE statements; data types used in MySQL; creating tables, indices and databases in MySQL; deleting tables and indices; altering existing table structures in MySQL.",
    "reading": "Murach’s MySQL, Chapters 4 & 5",
    "extraContent": [{"text": "Assignment 9", "href": "./assignments/assignment-9.html"}],
    "showSlides": false
},
{
    "mod": 11,
    "description": "This week we'll cover stored procedures in MySQL.",
    "showSlides": false
},
{
    "title": "Final exam",
    "description": "You got this.",
    "showSlides": false,
    "noSlides": true
}
]